Revit 2027 API
ColorSelectionDialog.SelectedColor Property
 The new color selected by the user.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color SelectedColor { get; }
Public ReadOnly Property SelectedColor As Color
	Get
public:
property Color^ SelectedColor {
	Color^ get ();
}
member SelectedColor : Color with get
Property Value
Color
See Also
Reference
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace